export default {
  /* HTTP level status code*/
  'http.0': '网络不好,请稍后再试',
  'http.403': '您无权访问此资源',
  'http.others': '请求失败（状态码：0），请稍后再试',

  /* Application level error code */
  '1000': '请求失败（状态码：1），请稍后再试',
  '1001': '请求失败（状态码：2），请稍后再试',
  '1002': '请求失败（状态码：3），请稍后再试',
  '1011': '存在无效参数（如参数为空或超出正常范围）',
  '1012': '参数格式错误',
  '1013': '系统参数错误',
  '1020': '用户名或密码无效',
  '1021': '令牌无效，请尝试重新登录',
  '1022': '令牌无效，请尝试重新登录',
  '1023': '令牌類型錯誤',
  '10000': '测试应用层通知 : SILENT',
  '10001': '测试应用层通知 : WARN_MESSAGE',
  '10002': '测试应用层通知 : ERROR_MESSAGE',
  '10003': '测试应用层通知 : NOTIFICATION',
  '10009': '测试应用层通知 : REDIRECT',
};
